---
kind: property
id: P:Autodesk.Revit.DB.Analysis.EnergyAnalysisSpace.SpaceName
source: html/e35fda64-158d-c86b-95e8-d2f212780443.htm
---
# Autodesk.Revit.DB.Analysis.EnergyAnalysisSpace.SpaceName Property

The name.

## Syntax (C#)
```csharp
public string SpaceName { get; }
```